---
type: HVACLoadBuildingType
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 8
tags: [revit-api, class]
---

# HVACLoadBuildingType

`Autodesk.Revit.DB.Analysis.HVACLoadBuildingType` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2018 | `public static HVACLoadBuildingType Create ( Document document , string name )` |
| Method | IsNameUnique | — | `` |
| Method | IsValidTime | 2018 | `public static bool IsValidTime ( string hourMinute )` |
| Property | BuildingTypeName | 2018 | `public string BuildingTypeName { get ; set ; }` |
| Property | ClosingTime | 2018 | `public string ClosingTime { get ; set ; }` |
| Property | OpeningTime | 2018 | `public string OpeningTime { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | UnoccupiedCoolingSetPoint | 2018 | `public double UnoccupiedCoolingSetPoint { get ; set ; }` |